N = int(input())
'''
Задача: выбрать из троек по 2 числа так, чтобы сумма
была кратна 4 и была максимально возможной

-------------------------------------------------

Считываем 3 элемента в массив, сортируем его,
выбираем максимальную пару. Далее определяем
МИНИМАЛЬНУЮ РАЗНОСТЬ МЕЖДУ (1 И 2) И (0 И 2) 
ЭЛЕМЕНТАМИ И БЕРЕМ ОСТАТОК ПРИ ДЕЛЕНИИ НА 4, И
ЗАПИСЫВАЕМ ЕГО В СООТВЕТСТВУЮЩУЮ ПЕРЕМЕННУЮ!!!

Получили сумму максимальных элементов и 3 числа:
минимальная разность % 4 == 1, %4 == 2, %4 == 3.
Смотрим остаток суммы при делении на 4 и если
он не 0, то вычитаем минимальную разность
С ТАКИМ ЖЕ ОСТАТКОМ!!!
'''
a = [0,0,0]
maxSum = 0
mindelta1 = 10001 # мин разность % 4 == 1
mindelta2 = 10001 # мин разность % 4 == 2
mindelta3 = 10001 # мин разность % 4 == 3
for i in range(N):
	a[0] = int(input())
	a[1] = int(input())
	a[2] = int(input())
	for x in range(3):
		for k in range(x,3):
			if a[k] > a[x]:
				t = a[x]
				a[x] = a[k]
				a[k] = t
				# ортировка массива
	maxSum += a[0] + a[1]
	if (a[1] - a[2]) % 4 == 1 and (a[1] - a[2]) < mindelta1:
		mindelta1 = (a[1] - a[2])
	elif (a[1] - a[2]) % 4 == 2 and (a[1] - a[2]) < mindelta2:
		mindelta2 = (a[1] - a[2])
	elif (a[1] - a[2]) % 4 == 3 and (a[1] - a[2]) < mindelta3:
		mindelta3 = (a[1] - a[2])
	if (a[0] - a[2]) % 4 == 1 and (a[0] - a[2]) < mindelta1:
		mindelta1 = (a[0] - a[2])
	elif (a[0] - a[2]) % 4 == 2 and (a[0] - a[2]) < mindelta2:
		mindelta2 = (a[0] - a[2])
	elif (a[0] - a[2]) % 4 == 3 and (a[0] - a[2]) < mindelta3:
		mindelta3 = (a[0] - a[2])
	# определяем минимальные разности
if maxSum % 4 == 2:
	print(maxSum - mindelta2)
elif maxSum % 4 == 1:
	print(maxSum - mindelta1)
elif maxSum % 4 == 3:
	print(maxSum - mindelta3)
else:
	print(maxSum)